alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/common_src/driver/driver_main.c
//------------------------------------------------------------------------------
// Copyright (c) Qualcomm Atheros, Inc.
// All rights reserved.
// Redistribution and use in source and binary forms, with or without modification, are permitted (subject to
// the limitations in the disclaimer below) provided that the following conditions are met:
//
// · Redistributions of source code must retain the above copyright notice, this list of conditions and the
//   following disclaimer.
// · Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
//   following disclaimer in the documentation and/or other materials provided with the distribution.
// · Neither the name of nor the names of its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE. THIS SOFTWARE IS
// PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING,
// BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
// DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
// INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
// ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//------------------------------------------------------------------------------
//==============================================================================
// Author(s): ="Atheros"
//==============================================================================
#include <a_config.h>
#include <a_types.h>
#include <driver_cxt.h>
#include <common_api.h>
#include <custom_wlan_api.h>
#include <wmi_api.h>
#include <netbuf.h>
#include <htc.h>
#include <spi_hcd_if.h>
#include <hcd_api.h>

#include "atheros_wifi_api.h"
#include "atheros_wifi_internal.h"
#include "wifi_driver_main.h" //for OS Dependent
#include "fsl_debug_console.h"

/*****************************************************************************/
/********** IMPLEMENTATION **********/
/*****************************************************************************/

uint32_t g_totAlloc = 0;
uint32_t g_poolid = 0xffffffff;

/*****************************************************************************/
/*  Driver_Main - This is the top level entry point for the Atheros wifi driver
 *   This should be called from either a dedicated thread running in a loop or,
 *   in the case of single threaded systems it should be called periodically
 *   from the main loop.  Also, if in a single threaded system a API call
 *   requires synchronous completion then it may be necessary to call this
 *   function from within the API call.
 *      void *pCxt - the driver context.
 *      uint8_t scope - Limits/allows what type of activity may be processed.
 *          Options are any combination of DRIVER_SCOPE_TX + DRIVER_SCOPE_RX.
 *      boolean *pCanBlock - used to report to caller whether the driver is
 *          in a state where it is safe to block until further notice.
 *		uint16_t *pBlock_msec - used to report to caller how long the driver
 *			may block for. if zero then driver can block indefinitely.
 *****************************************************************************/
A_STATUS
Driver_Main(void *pCxt, uint8_t scope, boolean *pCanBlock, uint16_t *pBlock_msec)
{
    void *pReq;
    A_DRIVER_CONTEXT *pDCxt = GET_DRIVER_COMMON(pCxt);

    HW_ProcessPendingInterrupts(pCxt); // IGX_UD_CHANGES

    /* This is where packets are received from the
     * wifi device. Because system buffers must be
     * available to receive a packet we only call into
     * this function if we know that buffers are
     * available to satisfy the operation.
     */
    if ((scope & DRIVER_SCOPE_RX) && true == Driver_RxReady(pCxt))
    {
        pDCxt->driver_state = DRIVER_STATE_RX_PROCESSING;
        pReq = pDCxt->pRxReq;
        pDCxt->pRxReq = NULL;
        if (A_OK != Driver_RecvPacket(pCxt, pReq))
        {
            /* if this happens it is a critical error */
            A_ASSERT(0);
        }
        /* FIXME: as an optimization the next lookahead may have
         * been acquired from the trailer of the previous rx packet.
         * in that case we should pre-load the lookahead so as to
         * avoid reading it from the registers. */
        /* reset the lookahead for the next read operation */
        pDCxt->lookAhead = 0;
        /* check to see if a deferred bus request has completed. if so
      * process it. */
        if (pDCxt->booleans & SDHD_BOOL_DMA_COMPLETE)
        {
            /* get the request */
            if (A_OK == Driver_CompleteRequest(pCxt, pDCxt->spi_hcd.pCurrentRequest))
            {
                /* clear the pending request and the boolean */
                pDCxt->spi_hcd.pCurrentRequest = NULL;
                pDCxt->booleans &= ~SDHD_BOOL_DMA_COMPLETE;
            }
        }
    }

    pDCxt->driver_state = DRIVER_STATE_PENDING_CONDITION_D;

    if ((scope & DRIVER_SCOPE_TX) && true == Driver_TxReady(pCxt))
    {
        pDCxt->driver_state = DRIVER_STATE_TX_PROCESSING;
        /* after processing any outstanding device interrupts
         * see if there is a packet that requires transmitting
         */
        if (pDCxt->txQueue.count)
        {
            /* accesslock here to sync with threads calling
             * submit TX
             */
            TXQUEUE_ACCESS_ACQUIRE(pCxt);
            {
                pReq = A_NETBUF_DEQUEUE(&(pDCxt->txQueue));
            }
            TXQUEUE_ACCESS_RELEASE(pCxt);

