alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/common_src/driver/driver_main.c
            if (pReq != NULL)
            {
                Driver_SendPacket(pCxt, pReq);
            }
        }
    }

    pDCxt->driver_state = DRIVER_STATE_PENDING_CONDITION_E;

    /* execute any asynchronous/special request when possible */
    if (0 == (pDCxt->booleans & SDHD_BOOL_DMA_IN_PROG) && pDCxt->asynchRequest)
    {
        pDCxt->driver_state = DRIVER_STATE_ASYNC_PROCESSING;
        pDCxt->asynchRequest(pCxt);
        pDCxt->driver_state = DRIVER_STATE_PENDING_CONDITION_F;
    }

    pDCxt->driver_state = DRIVER_STATE_PENDING_CONDITION_G;
    /* allow caller to block if all necessary conditions are satisfied */
    if (pCanBlock)
    {
        if ((pDCxt->spi_hcd.PendingIrqAcks == 0 || pDCxt->rxBufferStatus == false) &&
            (pDCxt->spi_hcd.IrqDetected == false) && (pDCxt->txQueue.count == 0 || Driver_TxReady(pCxt) == false) &&
            (0 == (pDCxt->booleans & SDHD_BOOL_DMA_COMPLETE)))
        {
            *pCanBlock = true;

            if (pDCxt->creditDeadlock == true)
            {
                if (pBlock_msec)
                {
                    *pBlock_msec = DEADLOCK_BLOCK_MSEC;
                }

                pDCxt->creditDeadlockCounter++;
            }

            pDCxt->driver_state = DRIVER_STATE_IDLE;
        }
        else
        {
            *pCanBlock = false;
        }
    }

    return A_OK;
}

/*****************************************************************************/
/*  Driver_ReportRxBuffStatus - Tracks availability of Rx Buffers for those
 *	 systems that have a limited pool. The driver quearies this status before
 *	 initiating a RX packet transaction.
 *      void *pCxt - the driver context.
 *      boolean status - new status true - RX buffers are available,
 *			false - RX buffers are not available.
 *****************************************************************************/

#if defined(DRIVER_CONFIG_IMPLEMENT_RX_FREE_MULTIPLE_QUEUE)
uint8_t GetQueueIndexByEPID(uint8_t epid)
{
    uint8_t i;

    for (i = 0; i < 8; i++)
        if (GET_QUEUE_MASK(i) & (1 << epid))
            break;
    if (i >= 1 && i < 8)
        i = 7;
    return i;
}

uint8_t GetQueueCtrlIndexByEPID(uint8_t epid)
{
    uint8_t i;

    for (i = 0; i < 8; i++)
        if (GET_QUEUE_MASK(i) & (1 << epid))
            break;
    return i;
}

void Driver_ReportRxBuffStatus(void *pCxt, boolean status, uint8_t epid)
{
    boolean oldStatus; // CHECKME
    uint8_t bufNdx;
    A_DRIVER_CONTEXT *pDCxt = GET_DRIVER_COMMON(pCxt);

    bufNdx = GetQueueIndexByEPID(epid);
    /* NOTE: Dont acquire the lock here instead the
     * caller should acquire this lock if necessary prior to calling this function */
    // RXBUFFER_ACCESS_ACQUIRE(pCxt);

    oldStatus = pDCxt->rxBufferStatus;

    if (status)
    {
        pDCxt->rxMultiBufferStatus |= 1 << bufNdx;
    }
    else
    {
        pDCxt->rxMultiBufferStatus &= ~(1 << bufNdx);
    }
    pDCxt->rxBufferStatus = (pDCxt->rxMultiBufferStatus != 0);

    // RXBUFFER_ACCESS_RELEASE(pCxt);
    /* the driver thread may have blocked on this
     * status so conditionally wake up the thread
     * via QueueWork */
    if ((oldStatus == false) && (status == true))
    {
        if (pDCxt->hcd.PendingIrqAcks)
        {
            DRIVER_WAKE_DRIVER(pCxt);
        }
    }
}
#else
void Driver_ReportRxBuffStatus(void *pCxt, boolean status)
{
    boolean oldStatus;
    A_DRIVER_CONTEXT *pDCxt = GET_DRIVER_COMMON(pCxt);

    /* NOTE: Dont acquire the lock here instead the
     * caller should acquire this lock if necessary prior to calling this function */
    // RXBUFFER_ACCESS_ACQUIRE(pCxt);
    {
        oldStatus = pDCxt->rxBufferStatus;
        pDCxt->rxBufferStatus = status;
    }
    // RXBUFFER_ACCESS_RELEASE(pCxt);
    /* the driver thread may have blocked on this
     * status so conditionally wake up the thread
     * via QueueWork */
    if (oldStatus == false && status == true)
    {
        if (pDCxt->spi_hcd.PendingIrqAcks)
        {
            DRIVER_WAKE_DRIVER(pCxt);
        }
    }
}
#endif

/*****************************************************************************/
/*  Driver_CompleteRequest - Completes a deferred request. One that finished
 *      asynchronously. Such a request must have a non-null callback that will
 *      be called by this function to fullfill the operation.
 *      void *pCxt - the driver context.
 *      void *pReq - the bus request object.
 *****************************************************************************/
A_STATUS
Driver_CompleteRequest(void *pCxt, void *pReq)
{
    A_STATUS status = A_ERROR;
    void (*cb)(void *, void *);
    A_DRIVER_CONTEXT *pDCxt = GET_DRIVER_COMMON(pCxt);
    /* A hardware WAR exists whereby interrupts from the device are disabled
     * during an ongoing bus transaction.  This function is called when
     * the bus transaction completes.  if irqMask is set then it means that
     * interrupts should be re-enabled */
    if (pDCxt->spi_hcd.irqMask)
    {
        Hcd_UnmaskInterrupts(pCxt, pDCxt->spi_hcd.irqMask);
        pDCxt->spi_hcd.irqMask = 0;
    }

    if (pReq != NULL && NULL != (cb = A_NETBUF_GET_ELEM(pReq, A_REQ_CALLBACK)))
    {
        cb(pCxt, pReq);
        status = A_OK;
    }
    else
    {
        A_ASSERT(0);
    }

    return status;
}

/*****************************************************************************/
/*  Driver_TxReady - Determines whether it is safe to start a TX operation. If
 *     a TX operation can be started this function returns true else false.
 *      void *pCxt - the driver context.
 *****************************************************************************/
boolean Driver_TxReady(void *pCxt)
{
    boolean res = false;
    void *pReq;
    A_ENDPOINT_T *pEp;
    A_DRIVER_CONTEXT *pDCxt = GET_DRIVER_COMMON(pCxt);

    pDCxt->creditDeadlock = false;

    do
    {
        /* there can be no errors */
        if (pDCxt->booleans & SDHD_BOOL_FATAL_ERROR)
        {
            break;
        }
        /* there can be no in-complete requests */
        if ((pDCxt->booleans & SDHD_BOOL_DMA_IN_PROG) || (pDCxt->booleans & SDHD_BOOL_DMA_COMPLETE) ||
            /* the write buffer watermark interrupt must not be configured */
            (pDCxt->booleans & SDHD_BOOL_DMA_WRITE_WAIT_FOR_BUFFER))
        {
            break;
        }

        /* there must be enough credits for the target endpoint */
        if (NULL == (pReq = A_NETBUF_PEEK_QUEUE(&(pDCxt->txQueue))))
        {
            break;
        }

        if (NULL == (pEp = Util_GetEndpoint(pCxt, A_NETBUF_GET_ELEM(pReq, A_REQ_EPID))))
        {
            break;
        }
        /* ensure as sanity check that the request length is less than a credit length */
        if (pDCxt->creditSize < DEV_CALC_SEND_PADDED_LEN(pDCxt, A_NETBUF_LEN(pReq)))
        {
            // THIS IS AN ERROR AS REQUESTS SHOULD NEVER EXCEED THE CREDIT SIZE
            A_ASSERT(0);
#if DRIVER_CONFIG_DISABLE_ASSERT
            break;
#endif
        }
#if RESERVE_ONE_CREDIT_FOR_CONTROL
        if ((pEp->epIdx == 0) || (pEp->epIdx == 1))
        {
            /* confirm there are enough credits for this transfer */
            if (0 == pEp->credits)
            {
                // if(pDCxt->rxBufferStatus == false)
                {
                    /* need to use alternate mode to acquire credits */
                    Htc_GetCreditCounterUpdate(pCxt, A_NETBUF_GET_ELEM(pReq, A_REQ_EPID));

                    if (0 == pEp->credits)
                    { /* test again in case no new credits were acquired */
                        if (pDCxt->rxBufferStatus == false)
                        {
                            /* with no rx buffers to receive a credit report and no interrupt
                             * credits a condition exists where the driver may become deadlocked.
                             * Hence the creditDeadlock boolean is set to prevent the driver from
                             * sleeping.  this will cause the driver to poll for credits until
                             * the condition is passed.
                             */
                            pDCxt->creditDeadlock = true;
#if 0
        				if(pDCxt->creditDeadlockCounter >= MAX_CREDIT_DEADLOCK_ATTEMPTS){
        					/* This is a serious condition that can be brought about by
        					 * a flood of RX packets which generate TX responses and do not
        					 * return the RX buffer to the driver until the TX response
        					 * completes. To mitigate this situation purge the tx queue
        					 * of any packets on data endpoints.
        					 */
        					Driver_DropTxDataPackets(pCxt);
        					pDCxt->creditDeadlockCounter = 0;
        				}
#endif
                        }

                        break;
                    }
                }
                // else{
                //	break;/* wait for credit report from device */
                //}
            }
        }

        else
        {
            /* confirm there are enough credits for this transfer */
            if (pEp->credits <= 1)
            {
                // if(pDCxt->rxBufferStatus == false)
                {
                    /* need to use alternate mode to acquire credits */
                    Htc_GetCreditCounterUpdate(pCxt, A_NETBUF_GET_ELEM(pReq, A_REQ_EPID));

                    if (pEp->credits <= 1)
                    { /* test again in case no new credits were acquired */
                        if (pDCxt->rxBufferStatus == false)
                        {
                            /* with no rx buffers to receive a credit report and no interrupt
                             * credits a condition exists where the driver may become deadlocked.
                             * Hence the creditDeadlock boolean is set to prevent the driver from
                             * sleeping.  this will cause the driver to poll for credits until
                             * the condition is passed.
                             */
                            pDCxt->creditDeadlock = true;
#if 0
        				if(pDCxt->creditDeadlockCounter >= MAX_CREDIT_DEADLOCK_ATTEMPTS){
        					/* This is a serious condition that can be brought about by
        					 * a flood of RX packets which generate TX responses and do not
        					 * return the RX buffer to the driver until the TX response
        					 * completes. To mitigate this situation purge the tx queue
        					 * of any packets on data endpoints.
        					 */
        					Driver_DropTxDataPackets(pCxt);
        					pDCxt->creditDeadlockCounter = 0;
        				}
#endif
                        }

                        break;
                    }
                }
                // else{
                //	break;/* wait for credit report from device */
                //}
            }

        } /*(pEp->epIdx == 0) || (pEp->epIdx == 1)*/
#else
        if (0 == pEp->credits)
        {
            // if(pDCxt->rxBufferStatus == false)
            {
                /* need to use alternate mode to acquire credits */
                Htc_GetCreditCounterUpdate(pCxt, A_NETBUF_GET_ELEM(pReq, A_REQ_EPID));

                if (0 == pEp->credits)
                { /* test again in case no new credits were acquired */
                    if (pDCxt->rxBufferStatus == false)
                    {
                        /* with no rx buffers to receive a credit report and no interrupt
                         * credits a condition exists where the driver may become deadlocked.
                         * Hence the creditDeadlock boolean is set to prevent the driver from
                         * sleeping.  this will cause the driver to poll for credits until
                         * the condition is passed.
                         */
                        pDCxt->creditDeadlock = true;
#if 1
                        if(pDCxt->creditDeadlockCounter >= MAX_CREDIT_DEADLOCK_ATTEMPTS){
                            /* This is a serious condition that can be brought about by
                             * a flood of RX packets which generate TX responses and do not
                             * return the RX buffer to the driver until the TX response
                             * completes. To mitigate this situation purge the tx queue
                             * of any packets on data endpoints.
                             */
                            Driver_DropTxDataPackets(pCxt);
                            pDCxt->creditDeadlockCounter = 0;
                        }
#endif
                    }

                    break;
                }
            }
            // else{
            //	break;/* wait for credit report from device */
            //}
        }
#endif

        pDCxt->creditDeadlockCounter = 0;

