alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/common_src/driver/driver_main.c
        /* there must be enough write buffer space in the target fifo */
        if (pDCxt->spi_hcd.WriteBufferSpace <
            DEV_CALC_SEND_PADDED_LEN(pDCxt, A_NETBUF_LEN(pReq)) + ATH_SPI_WRBUF_RSVD_BYTES)
        {
            /* this will read the internal register to get the latest value for write buffer space */
            Hcd_RefreshWriteBufferSpace(pCxt);

            if (pDCxt->spi_hcd.WriteBufferSpace <
                DEV_CALC_SEND_PADDED_LEN(pDCxt, A_NETBUF_LEN(pReq)) + ATH_SPI_WRBUF_RSVD_BYTES)
            {
                /* there currently isn't enough space in the target fifo to accept this packet.
                 * Hence setup the write buffer watermark interrupt for future notification and exit. */
                Hcd_ProgramWriteBufferWaterMark(pCxt, DEV_CALC_SEND_PADDED_LEN(pDCxt, A_NETBUF_LEN(pReq)));
                /* wait for interrupt to indicate space available */
                break;
            }
        }
        /* all conditions are met to transmit a packet */
        res = true;
    } while (0);

    return res;
}

/*****************************************************************************/
/*  Driver_RxReady - Determines whether it is safe to start a RX operation. If
 *     a RX operation can be started this function returns true else false.
 *      void *pCxt - the driver context.
 *****************************************************************************/
boolean Driver_RxReady(void *pCxt)
{
    boolean res = false;
    HTC_FRAME_HDR *pHTCHdr;
    int32_t fullLength;
    uint32_t interrupts;
    A_DRIVER_CONTEXT *pDCxt = GET_DRIVER_COMMON(pCxt);

    do
    {
        /* there can be no errors */
        if (pDCxt->booleans & SDHD_BOOL_FATAL_ERROR)
        {
            break;
        }
        /* there can be no in-complete requests */
        if ((pDCxt->booleans & SDHD_BOOL_DMA_IN_PROG) || (pDCxt->booleans & SDHD_BOOL_DMA_COMPLETE))
        {
            break;
        }
        /* the wifi device must have indicated that a packet is ready */
        if (0 == pDCxt->spi_hcd.PendingIrqAcks)
        {
            break;
        }
        /* there must be rx buffers to process the request */
        if (false == pDCxt->rxBufferStatus && NULL == pDCxt->pRxReq)
        {
            break;
        }
        /* clear the pkt interrupt if its set. We do this here rather than in the
         * interrupt handler because we will continue to process packets until we
         * read a lookahead==0. only then will we unmask the interrupt */
        if (A_OK != Hcd_DoPioInternalAccess(pCxt, ATH_SPI_INTR_CAUSE_REG, &interrupts, true))
        {
            break;
        }

        if (interrupts & ATH_SPI_INTR_PKT_AVAIL)
        {
            interrupts = ATH_SPI_INTR_PKT_AVAIL;

            if (A_OK != Hcd_DoPioInternalAccess(pCxt, ATH_SPI_INTR_CAUSE_REG, &interrupts, false))
            {
                break;
            }
        }
        /* RX packet interrupt processing must be enabled */
        if (0 == (pDCxt->enabledSpiInts & ATH_SPI_INTR_PKT_AVAIL))
        {
            break;
        }
        /* As a last step read the lookahead and the Receive buffer register in an
         * effort to determine that a complete packet is ready for transfer. Do this
         * operation last as it does require several BUS transactions to complete. */
        if (0 == pDCxt->lookAhead)
        {
            /* need to refresh the lookahead */
            if (A_OK != Hcd_GetLookAhead(pCxt))
            {
                /* this is a major error */
                A_ASSERT(0);
            }
        }
        /* if lookahead is 0 then no need to proceed */
        if (0 == pDCxt->lookAhead)
        {
            if (0 != pDCxt->spi_hcd.PendingIrqAcks)
            {
                /* this should always be true here */
                pDCxt->spi_hcd.PendingIrqAcks = 0;
                Hcd_UnmaskInterrupts(pCxt, ATH_SPI_INTR_PKT_AVAIL);
            }

            break;
        }
        /* compare lookahead and recv buf ready value */
        pHTCHdr = (HTC_FRAME_HDR *)&(pDCxt->lookAhead);
        if (pDCxt->spi_hcd.ReadBufferSpace < sizeof(HTC_FRAME_HDR) ||
            pDCxt->spi_hcd.ReadBufferSpace < A_LE2CPU16(pHTCHdr->PayloadLen))
        {
            /* force a call to BUS_GetLookAhead on the next pass */
            pDCxt->lookAhead = 0;
            break;
        }
        /* there must be resources available to receive a packet */
        if (NULL == pDCxt->pRxReq)
        {
            fullLength =
                (int32_t)DEV_CALC_RECV_PADDED_LEN(pDCxt, A_LE2CPU16(pHTCHdr->PayloadLen) + sizeof(HTC_FRAME_HDR));

#if defined(DRIVER_CONFIG_IMPLEMENT_RX_FREE_MULTIPLE_QUEUE)
            {
                uint32_t flags, bufNdx;

                bufNdx = GetQueueIndexByEPID(pHTCHdr->EndpointID);
                flags = 1 << bufNdx;

                if (pDCxt->rxMultiBufferStatus & flags)
                {
                    /* try to get an RX buffer */
                    pDCxt->pRxReq = CUSTOM_DRIVER_GET_RX_REQ(pCxt, fullLength, pHTCHdr->EndpointID);
                }
            }
#else

            if (pDCxt->rxBufferStatus)
            {
                /* try to get an RX buffer */
                pDCxt->pRxReq = CUSTOM_DRIVER_GET_RX_REQ(pCxt, fullLength);
            }
#endif

            if (pDCxt->pRxReq == NULL)
            {
                break;
            }
            /* init the packet callback */
            A_NETBUF_SET_ELEM(pDCxt->pRxReq, A_REQ_CALLBACK, Driver_RxComplete);
        }
        /* all conditions are met to receive a packet */
        res = true;
    } while (0);

    return res;
}

void Driver_DropTxDataPackets(void *pCxt)
{
    A_DRIVER_CONTEXT *pDCxt = GET_DRIVER_COMMON(pCxt);
    void *pReq;
    uint16_t i, count;

    if (pDCxt->txQueue.count)
    {
        count = pDCxt->txQueue.count;
        /* accesslock here to sync with threads calling
         * submit TX
         */
        for (i = 0; i < count; i++)
        {
            TXQUEUE_ACCESS_ACQUIRE(pCxt);
            {
                pReq = A_NETBUF_DEQUEUE(&(pDCxt->txQueue));
            }
            TXQUEUE_ACCESS_RELEASE(pCxt);

