alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/common_src/driver/driver_main.c
            if (pReq != NULL)
            {
                if (A_NETBUF_GET_ELEM(pReq, A_REQ_EPID) > ENDPOINT_1)
                {
                    Driver_CompleteRequest(pCxt, pReq);
                }
                else
                {
                    TXQUEUE_ACCESS_ACQUIRE(pCxt);
                    /* re-queue the packet as it is not one we can purge */
                    A_NETBUF_ENQUEUE(&(pDCxt->txQueue), pReq);
                    TXQUEUE_ACCESS_RELEASE(pCxt);
                }
            }
        }
    }
}

#if defined(DRIVER_CONFIG_IMPLEMENT_RX_FREE_MULTIPLE_QUEUE)
extern A_NETBUF *ep0_buf;

void Driver_ReportReverseCredits(void *pReq)
{
    A_DRIVER_CONTEXT *pDCxt = GET_DRIVER_COMMON(p_Global_Cxt);
    A_NETBUF *pCurrTxReq;

#if 0
    A_ENDPOINT_T *pEp; 
    void *osbuf;
    void   *pReq;
    if (pDCxt->txQueue.count != 0)
    {
        pReq = A_NETBUF_PEEK_QUEUE(&(pDCxt->txQueue));
        pEp = Util_GetEndpoint(p_Global_Cxt, A_NETBUF_GET_ELEM(pReq, A_REQ_EPID));
        if (pEp->credits != 0)
            return;
    }
    osbuf = A_NETBUF_ALLOC(0);
    A_NETBUF_SET_ELEM(osbuf, A_REQ_EPID, 0);
    Driver_SubmitTxRequest(p_Global_Cxt, osbuf);
#else

    if (hasRCSReport() == false)
    {
        return;
    }

    pCurrTxReq = A_NETBUF_PEEK_QUEUE(&(pDCxt->txQueue));
    if (pCurrTxReq != NULL)
    {
        if (A_NETBUF_GET_ELEM(pCurrTxReq, A_REQ_EPID) == ENDPOINT_0)
            return;
    }

    a_netbuf_reinit(ep0_buf, 0);
    A_NETBUF_SET_ELEM(ep0_buf, A_REQ_EPID, 0);

    qosal_intr_disable();
    Driver_SubmitEp0TxRequest(p_Global_Cxt, ep0_buf);

    qosal_intr_enable();

#endif
}

#endif

A_STATUS
Driver_WaitForCondition(void *pCxt, volatile boolean *pCond, boolean value, uint32_t msec)
{
    A_STATUS status = A_OK;

    event_t *pEvent = &GET_DRIVER_CXT(pCxt)->userWakeEvent;

    while (1)
    {
        if (*pCond != value)
        {
            A_EVENT_FLAGS setFlags;
            if (A_OK != A_EVENT_WAIT(pEvent, 0x01, true, msec, &setFlags))
            {
                status = A_ERROR;
                break;
            }
            else
            {
                A_EVENT_CLEAR(pEvent, 0x01);
            }
            A_MDELAY(1);
        }
        else
        {
            break;
        }
    }

    return status;
}

#if 1
A_STATUS setup_host_dset(void *handle)
{
    return wmi_dset_host_cfg_cmd(handle);
}
#else
A_STATUS setup_host_dset(void *handle)
{
    return A_OK;
}
#endif

void Atheros_Driver_Task(void *pCxt)
{
    boolean canBlock = false;
    uint16_t block_msec = 1000; // TODO: what should be a correct value??
    uint32_t timeout = 0;

    do
    {
        PRINTF("Atheros_Driver_Task \r\n");
        if (A_OK == Driver_Init(pCxt))
        {
            PRINTF("Driver_Init A_OK \r\n");
            while (1)
            {
                if (canBlock)
                {
                    GET_DRIVER_COMMON(pCxt)->driverSleep = true;
                    timeout = block_msec;

                    if (block_msec && timeout == 0)
                    {
                        timeout = 1;
                    }
                    event_t *pEvent = &(GET_DRIVER_CXT(pCxt)->driverWakeEvent);
                    A_EVENT_FLAGS setFlags;
                    if (A_OK != A_EVENT_WAIT(pEvent, 0x01, true, timeout, &setFlags))
                    {
                        if (timeout == 0)
                        {
                            break;
                        }
                    }
                }

                GET_DRIVER_COMMON(pCxt)->driverSleep = false;

                if (GET_DRIVER_COMMON(pCxt)->driverShutdown == true)
                {
                    break;
                }

                Driver_Main(pCxt, DRIVER_SCOPE_RX | DRIVER_SCOPE_TX, &canBlock, &block_msec);
            }
            PRINTF("Driver_Main EXIT!! canblock = %d, block_msec = %d \r\n", canBlock, block_msec);
            Driver_DeInit(pCxt);
            DRIVER_WAKE_USER(pCxt);
        }
#if QOSAL_TASK_DESTRUCTION
    } while (0);

    atheros_wifi_task_id = QOSAL_NULL_TASK_HANDLE;
#else
        /* block on this event until a task wants to re-activate the driver thread */
        // qosal_task_suspend(NULL);
    } while (1);
#endif
}


void Driver_WakeDriver(void *pCxt)
{
    A_EVENT_SET(&(GET_DRIVER_CXT(pCxt)->driverWakeEvent), 0x01);
}

void Driver_WakeUser(void *pCxt)
{
    A_EVENT_SET(&(GET_DRIVER_CXT(pCxt)->userWakeEvent), 0x01);
}

void qcadrv_assert_func(const char *func_name, int line)
{
    PRINTF("QCADriver ASSERT at %s:%d\r\n", func_name, line);
    volatile int i = 1;
    while (i)
        ;
}
